/**/
"Cancel" = "Peruuta";
/**/
"Delete" = "Poista";
/**/
"Open" = "Avaa";
/**/
"Edit" = "Muokkaa";
/**/
"Yes" = "Kyllä";
/**/
"Finish" = "Valmis";
/**/
"Done" = "Valmis";
/**/
"Save" = "Tallenna";
/**/
"Undo" = "Kumoa";
/**/
"Redo" = "Tee uudelleen";
/**/
"OK" = "OK";
/**/
"Yes Delete" = "Kyllä, poista";


/*Geometry Edit Action Name*/
"Apply Geometry" = "Käytä geometriaa";
/*Geometry Edit Action Name*/
"Clear Geometry" = "Tyhjennä geometria";
/*Geometry Edit Action Name*/
"Delete Vertex" = "Poista taitepiste";
/*Geometry Edit Action Name*/
"Insert Part" = "Lisää osa";
/*Geometry Edit Action Name*/
"Insert Vertex" = "Lisää taitepiste";
/*Geometry Edit Action Name*/
"Move Vertex" = "Siirrä taitepiste";
/*Geometry Edit Action Name*/
"Remove Part" = "Poista osa";

/*Collecting attachments*/
"Add" = "Lisää";
/*Collecting attachments*/
"Take Photo or Video" = "Ota valokuva tai video";
/*Collecting attachments*/
"Choose From Library" = "Valitse kirjastosta";
/*Collecting attachments*/
"Photo" = "Valokuva";
/*Collecting attachments*/
"Video" = "Video";
/*Collecting attachments*/
"Save To Photo Library" = "Tallenna valokuvakirjastoon";
/*Collecting attachments*/
"Download" = "Lataa";

/*Date attribute*/
"Today" = "Tänään";

/**/
"Attachments" = "Liitteet";
"Attributes" = "Ominaisuustiedot";

/**/
"Open in Safari" = "Avaa Safarissa";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "Anna luku %i - %i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "Anna luku %@ - %@.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "Liian monta merkkiä (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "Luku ei ole sallitulla alueella.";

/* BLOB, RASTER, etc */
"Field type not supported" = "Kenttätyyppiä ei tueta";

/**/
"%d of %d" = "%d/%d";

/**/
"Changing Feature Type" = "Vaihdetaan kohdetyyppiä";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "Olet vaihtamassa kohdetyyppiä. Joitakin kenttäarvoja saatetaan korvata. Haluatko varmasti jatkaa?";

/**/
"Deleting Feature" = "Kohteen poistaminen";
"Are you sure you want to delete this feature?" = "Haluatko varmasti poistaa tämän kohteen?";

/**/
"Data for pie chart is invalid" = "Piirakkakaavion tiedot eivät kelpaa";
"No data to create a pie chart" = "Ei tietoja piirakkakaavion luomiseen";
"No image to display" = "Yhtään näytettävää kuvaa ei ole";

/**/
"Created by %@ seconds ago" = "Luonut %@, sekunteja sitten";

/**/
"Created by %@ a minute ago" = "Luonut %@, minuutti sitten";

/**/
"Edited by %@ seconds ago" = "Muokannut %@, sekunteja sitten";

/**/
"Edited by %@ a minute ago" = "Muokannut %@ minuutti sitten";

/**/
"Created seconds ago" = "Luotu sekuntia sitten";

/**/
"Created a minute ago" = "Luotu minuuttia sitten";

/**/
"Edited seconds ago" = "Muokattu sekuntia sitten";

/**/
"Edited a minute ago" = "Muokattu minuuttia sitten";

/**/
"Created by %@ %d minutes ago" = "Luonut %@, %d minuuttia sitten";

/**/
"Created by %@ an hour ago" = "Luonut %@, tunti sitten";

/**/
"Created by %@ %d hours ago" = "Luonut %@, %d tuntia sitten";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "Luonut %@, %@ klo %@";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "Luonut %@, %@ klo %@";

/**/
"Edited by %@ %d minutes ago" = "Muokannut %@, %d minuuttia sitten";

/**/
"Edited by %@ an hour ago" = "Muokannut %@, tunti sitten";

/**/
"Edited by %@ %d hours ago" = "Muokannut %@, %d tuntia sitten";

/**/
"Edited by %@ on %@ at %@ - day" = "Muokannut %@, %@ klo %@";

/**/
"Edited by %@ on %@ at %@ - full" = "Muokannut %@, %@ klo %@";

/**/
"Created by %@" = "Luonut %@";

/**/
"Edited by %@" = "Muokannut %@";

/**/
"Created %d minutes ago" = "Luotu %d minuuttia sitten";

/**/
"Created an hour ago" = "Luotu tunti sitten";

/**/
"Created %d hours ago" = "Luotu %d tuntia sitten";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "Luontiaika: %@ klo %@";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "Luontiaika: %@ klo %@";

/**/
"Edited %d minutes ago" = "Muokattu %d minuuttia sitten";

/**/
"Edited an hour ago" = "Muokattu tunti sitten";

/**/
"Edited %d hours ago" = "Muokattu %d tuntia sitten";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "Muokkausaika: %@ klo %@";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "Muokkausaika: %@ klo %@";

/* Used to denote a required field */
"Required" = "Pakollinen";

/* Used for naming layers with no names */
"Layer %d" = "Taso %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "Sijainnin osoitetta ei löydy";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "Osoitteen sijaintia ei löydy";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "Osoitetta ei voi lukea";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "Tiedostoa ei löydy";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "Paikanninta ei voi ladata";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "Paikantimen sisäinen virhe";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "Paikannin ei tue risteysten geokoodausta";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "Virheellisiä paikantimen ominaisuuksia";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "Pakollinen kenttä puuttuu";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "Paikanninta ei ole alustettu";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "Paikantimen muoto ei ole käytettävissä";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "Projektion muunto ei ole käytettävissä";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "Koordinaatistotiedot eivät ole käytettävissä";

/*Geocoding: core: used when locator being used does not support reverse geocoding */
"Reverse geocoding not supported with this locator." = "Tämä paikannin ei tue käänteistä geokoodausta.";

/* Network analyst errors */
"Cannot open network." = "Verkkoa ei voi avata.";
"Cannot retrieve route task parameters." = "Reittitehtävän parametreja ei voi hakea.";
"Insufficient number of stops." = "Pysähdysten määrä ei riitä.";
"Stop (%@) was not located." = "Pysähdystä (%@) ei paikannettu.";
"Stop (%@) is located on a non traversable element." = "Pysähdys (%@) sijaitsee elementissä, jonka läpi ei voi kulkea.";
"Stop (%@) is located on a soft restricted element." = "Pysähdys (%@) sijaitsee pehmeän rajoituksen elementissä.";
"Point barrer (%@) was not located." = "Piste-estettä (%@) ei paikannettu.";
"Point barrier (%@) has invalid added cost attribute name." = "Piste-esteen (%@) lisähaittapisteen ominaisuustiedon nimi on virheellinen.";
"Line barrier (%@) has invalid scaled cost attribute name." = "Viivaesteen (%@) skaalatun haittapisteen ominaisuustiedon nimi on virheellinen.";
"Line barrier (%@) does not cover any network elements." = "Viivaeste (%@) ei peitä yhtään verkon elementtiä.";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "Alue-esteen (%@) skaalatun haittapisteen ominaisuustiedon nimi on virheellinen.";
"Polygon barrier (%@) does not cover any network elements." = "Alue-este (%@) ei peitä yhtään verkon elementtiä.";
"'%@' is an invalid impedance attribute." = "%@ on virheellinen impedanssin ominaisuustieto.";
"'%@' restriction attribute is invalid." = "Rajoituksen ominaisuustieto %@ on virheellinen.";
"'%@' accumulate attribute is invalid." = "Kumuloitava ominaisuustieto %@ on virheellinen.";
"'%@' is an invalid directions time attribute." = "%@ on virheellinen reittiohjeiden ajan ominaisuustieto.";
"Directions distance attribute is invalid." = "Reittiohjeiden etäisyyden ominaisuustieto on virheellinen.";
"Invalid attribute parameter attribute name (%@)." = "Virheellinen ominaisuustietoparametrin ominaisuustiedon nimi (%@).";
"Invalid attribute parameter parameter name (%@)." = "Virheellinen ominaisuustietoparametrin parametrin nimi (%@).";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "Virheellinen arvotyyppi ominaisuustiedon (%1$@) parametrille (%2$@).";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "Virheellinen rajoituksen käytön arvo ominaisuustiedon (%1$@) parametrille (%2$@).";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "Neutraali rajoituksen käytön arvo ominaisuustiedon (%1$@) parametrille (%2$@).";
"Soft restricted element (%@) was traversed." = "Pehmeän rajoituksen elementin (%@) läpi kuljettiin.";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "Verkossa ei ole hierarkiaominaisuustietoa hierarkkista reittisuunnittelua varten.";
"No path can be found between a given pair of stops (%@)." = "Annetun kohdeparin välille ei löydy polkua (%@).";
"The input spatial reference is undefined." = "Lähtökoordinaatistotietoja ei ole määritetty.";
"The output spatial reference is undefined." = "Tuloskoordinaatistotietoja ei ole määritetty.";
"The directions style is invalid." = "Reittiohjeiden tyyli on virheellinen.";
"The directions language is invalid." = "Reittiohjeiden kieli on virheellinen.";
"Directions time and distance attributes do not match." = "Reittiohjeiden aika- ja etäisyysominaisuustiedot eivät täsmää.";
"The directions road class attribute is invalid." = "Reittiohjeiden tieluokan ominaisuustieto on virheellinen.";
"Unknown condition." = "Tuntematon ehto.";
"Invalid route task parameters." = "Virheelliset reittitehtävän parametrit.";
"Route task's solution cannot be found." = "Reittitehtävän ratkaisua ei löydy.";
"Route task was cancelled." = "Reittitehtävä peruutettiin.";
"Route task internal error." = "Reittitehtävän sisäinen virhe.";
"Route name property is not supported for local route task." = "Reitin nimiominaisuus ei ole käytettävissä paikallisessa reittitehtävässä.";
"Local route task parameters should be retrieved from route task." = "Paikallisen reittitehtävän parametrit on haettava reittitehtävästä.";
"Cannot retrieve network description." = "Verkon kuvausta ei voi hakea.";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Vain yksi pituuden ominaisuustieto voidaan määrittää impedanceAttributeName- ja accumulateAttributeNames-ominaisuudelle.";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "Vain yksi ajan ominaisuustieto voidaan määrittää impedanceAttributeName- ja accumulateAttributeNames-ominaisuudelle.";
"Service not supported." = "Palvelua ei tueta.";
"Specified start time occurs before January 1, 1970." = "Määritetty aloitusaika on ennen 1.1.1970.";
"Stop (%@) has a start time that occurs before January 1, 1970." = "Pysähdyksen (%@) aloitusaika on ennen 1.1.1970.";
"Stop (%@) has a local time window that starts before January 1, 1970." = "Pysähdyksellä (%@) on paikallinen aikaikkuna, joka alkaa ennen 1.1.1970.";
"Stop (%@) has a UTC time window that starts before January 1, 1970." = "Pysähdyksellä (%@) on UTC-aikaikkuna, joka alkaa ennen1.1.1970.";
"Stop (%@) has a time window end that occurs before its time window start." = "Pysähdyksellä (%@) on aikaikkuna, joka päättyy ennen sen aloitusaikaa.";

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "ft";
"in" = "kohteessa";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "mpk";
"pt" = "pt";
"Unknown" = "Tuntematon";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "Senttimetriä";
"Decimal Degrees" = "Desimaaliastetta";
"Decimeters" = "Desimetriä";
"Feet" = "Jalkaa";
"Inches" = "Tuumaa";
"Kilometers" = "Kilometriä";
"Meters" = "Metriä";
"Miles" = "Mailia";
"Millimeters" = "Millimetriä";
"Nautical Miles" = "Meripeninkulmaa";
"Points" = "Pistettä";
"Yards" = "Jaardia";

/* Area Units Abbreviated Strings */
"sq. in" = "sq. in";
"sq. ft" = "sq. ft";
"sq. yd" = "sq. yd";
"ac" = "ac";
"sq. mi" = "sq. mi";
"sq. mm" = "mm2";
"sq. cm" = "cm2";
"sq. dm" = "dm2";
"sq. m" = "m2";
"ares" = "a";
"ha" = "ha";
"sq. km" = "km2";

/* Area Units Display Strings */
"Square Inches" = "Neliötuumaa";
"Square Feet" = "Neliöjalkaa";
"Square Yards" = "Neliöjaardia";
"Acres" = "Eekkeriä";
"Square Miles" = "Neliömailia";
"Square Millimeters" = "Neliömillimetriä";
"Square Centimeters" = "Neliösenttimetriä";
"Square Decimeters" = "Neliödesimetriä";
"Square Meters" = "Neliömetriä";
"Ares" = "Aaria";
"Hectares" = "Hehtaaria";
"Square Kilometers" = "Neliökilometriä";

/* Errors */
"Error" = "Virhe";
"Class not @protocol AGSJSONSerializable compliant" = "Luokka ei ole @protocol AGSJSONSerializable -yhteensopiva";
"Authorization required" = "Todennus vaaditaan";
"Token is invalid or has expired" = "Tunnus on väärä tai on vanhentunut";
"Unknown error occurred" = "Tuntematon virhe";
"Empty username/password" = "Tyhjä käyttäjätunnus/salasana";
"Token URL is nil. You must set a valid token URL on the credential." = "Tunnuksen URL on tyhjä. Määritä varmenteeseen kelvollinen tunnuksen URL.";
"Unknown authentication error" = "Tuntematon todennusvirhe";
"Error extracting identity" = "Virhe haettaessa identiteettiä";
"Error adding identity to the keychain" = "Virhe lisättäessä identiteettiä avainketjuun";
"Invalid Credentials" = "Virheelliset tunnukset";
"Bad URL." = "Virheellinen URL.";
"The feature layer does not expose an object-id field." = "Kohdekarttataso ei paljasta objektitunnuksen kenttää.";
"Both geodatabase and syncParams are required for this method." = "Sekä geotietokanta että syncParams tarvitaan tälle menetelmälle.";
"Uploading deltas is not supported with this replica." = "Deltojen palvelimelle lataamista ei tueta tässä kopiossa.";
"Error creating delta geodatabase" = "Virhe luotaessa delta-geotietokantaa";
"Unable to create result image layer" = "Tuloskuvatasoa ei voi luoda";
"Cache at path '%@' not found." = "Välimuistia ei löytynyt polusta ”%@”.";
"To add an item, you must be logged in to the portal." = "Sinun on kirjauduttava portaaliin, ennen kuin voit lisätä kohteen.";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "Sinun on määritettävä AGSPortalItemContentParameters-arvo, jotta voit lisätä kohteen.";
"The portal failed to add the item." = "Portaali ei onnistunut lisäämään kohdetta.";
"To delete an item, you must be logged in to the portal." = "Sinun on kirjauduttava portaaliin, ennen kuin voit poistaa kohteen.";
"The portal failed to delete the item." = "Portaali ei onnistunut poistamaan kohdetta.";
"To update an item, an itemId and logged in user are required." = "Kirjautunut käyttäjä ja itemId tarvitaan, ennen kuin kohteen voi päivittää.";
"The item failed to update." = "Kohteen päivitys epäonnistui.";
"The item failed to update JSON." = "Kohde ei onnistunut päivittämään JSON-muotoa.";
"You must be logged in to a portal to add a comment." = "Sinun on kirjauduttava portaaliin, ennen kuin voit lisätä kommentin.";
"The comment failed to be added." = "Kommentin lisääminen epäonnistui.";
"You must be logged in to a portal to fetch the current user's rating." = "Sinun on kirjauduttava portaaliin, jotta voit hakea nykyisen käyttäjän luokituksen.";
"You must be logged in to a portal to add a rating." = "Sinun on kirjauduttava portaaliin, jotta voit lisätä luokituksen.";
"The rating failed to be added." = "Luokituksen lisääminen epäonnistui.";
"To share an item, you must be logged in to the portal." = "Sinun on kirjauduttava portaaliin, ennen kuin voit jakaa kohteen.";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "Jos haluat lopettaa kohteen jakamisen, kirjaudu portaaliin ja määritä ryhmät, joiden kanssa kohdetta ei enää jaeta.";
"Bad Request" = "Virheellinen pyyntö";
"Credential Required" = "AGSCredential vaaditaan";
"Job not created" = "Työtä ei luotu";
"Service did not return a valid URL" = "Palvelu ei palauttanut kelvollista URL-osoitetta";
"Service did not return a file" = "Palvelu ei palauttanut tiedostoa";
"Service did not return a size" = "Palvelu ei palauttanut kokoa";
"Job failed" = "Työ epäonnistui";
"Job timed out" = "Työ on aikakatkaistu";
"Job was cancelled" = "Työ on peruutettu";
"Job was deleted" = "Työ on poistettu";
"Feature with objectId: %d not found" = "Kohdetta, jonka objektitunnus on %d, ei löytynyt";
"No object-id values specified for feature table query." = "Kohdetaulun kyselyyn ei ole määritetty objektitunnusten arvoja.";

/* OAuth */
"The specified clientID is invalid" = "Määritetty työasematunnus on virheellinen";

/* Sync */
"Upload is not supported with this service." = "Tämä palvelu ei tue siirtoa.";
"In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified." = "Synkronoinnin kutsuminen edellyttää, että muu synkronointisuunta kuin AGSGDBSyncDirectionNone on määritetty.";